Tekla.Structures.Model.ContourPlate.ContourPlateTypeEnum
The contour plate types.

Tekla.Structures.Model.ContourPlate.ContourPlateTypeEnum.UNKNOWN
The unknown type.

Tekla.Structures.Model.ContourPlate.ContourPlateTypeEnum.PLATE
The plate-like contour plate.

Tekla.Structures.Model.ContourPlate.ContourPlateTypeEnum.SLAB
The slab-like contour plate.